ettore9x9/dsPIC30F4011/PWMProject.X/main.c
/*
 * File:   main.c
 * Authors: Carlone Matteo, Maragliano Matteo, Musumeci Mattia, Sani Ettore
 *
 * Created on 27 settembre 2022, 11.16
 */

// DSPIC30F4011 Configuration Bit Settings

// 'C' source line config statements

// FOSC
#pragma config FPR = XT                 // Primary Oscillator Mode (XT)
#pragma config FOS = PRI                // Oscillator Source (Primary Oscillator)
#pragma config FCKSMEN = CSW_FSCM_OFF   // Clock Switching and Monitor (Sw Disabled, Mon Disabled)

// FWDT
#pragma config FWPSB = WDTPSB_16        // WDT Prescaler B (1:16)
#pragma config FWPSA = WDTPSA_512       // WDT Prescaler A (1:512)
#pragma config WDT = WDT_OFF            // Watchdog Timer (Disabled)

// FBORPOR
#pragma config FPWRT = PWRT_64          // POR Timer Value (64ms)
#pragma config BODENV = BORV20          // Brown Out Voltage (Reserved)
#pragma config BOREN = PBOR_ON          // PBOR Enable (Enabled)
#pragma config LPOL = PWMxL_ACT_HI      // Low-side PWM Output Polarity (Active High)
#pragma config HPOL = PWMxH_ACT_HI      // High-side PWM Output Polarity (Active High)
#pragma config PWMPIN = RST_IOPIN       // PWM Output Pin Reset (Control with PORT/TRIS regs)
#pragma config MCLRE = MCLR_EN          // Master Clear Enable (Enabled)

// FGS
#pragma config GWRP = GWRP_OFF          // General Code Segment Write Protect (Disabled)
#pragma config GCP = CODE_PROT_OFF      // General Segment Code Protection (Disabled)

// FICD
#pragma config ICS = ICS_PGD            // Comm Channel Select (Use PGC/EMUC and PGD/EMUD)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>

#define TIMER_FOR_BUTTON_S5 3
#define TIMER_FOR_BUTTON_S6 4

#include "my_timer_lib.h"
#include "my_print_lib.h"
#include "my_circular_buffer_lib.h"
#include "my_btn_lib.h"
#include <stdio.h>

void exercise1() {
    PTCONbits.PTMOD = 0;     // free running mode
    PTCONbits.PTCKPS = 0b0;  // prescaler
    PWMCON1bits.PEN2H = 1;   // output high bit
    PWMCON1bits.PEN2L = 1;   // output low bit
    PTPER = 1842;            // time period
    PDC2 = PTPER;            // duty cycle
    PTCONbits.PTEN = 1;      // enable the PWM
    while(1);
}

void exercise2() {
    PTCONbits.PTMOD = 0;     // free running mode
    PTCONbits.PTCKPS = 0b0;  // prescaler
    PWMCON1bits.PEN2H = 1;   // output high bit
    PWMCON1bits.PEN2L = 1;   // output low bit
    PTPER = 1842;            // time period
    PDC2 = PTPER;            // duty cycle
    DTCON1bits.DTAPS = 0b10;    // dead time prescaler
    DTCON1bits.DTA = 18;     // dead time
    PTCONbits.PTEN = 1;      // enable the PWM
    while(1);
}

int main(void)
{
    // exercise1();
    exercise2();
}